{"navLinks":[{"name":"About","href":"#about"},{"name":"Contact","href":"#contact"}],"branding":{"logoTop":"/uploads/1768917977598-logo.png","logoBottom":"/uploads/1768917103354-NEW_PDIA_LOGO.jpg"},"services":[{"icon":"/uploads/1768920899998-logo.png","title":"Curriculum Design & Review","description":"We develop and adapt curricula that are competency-based, inclusive, culturally responsive, and aligned with both national and global standards. Our work supports both formal and non-formal education settings."},{"icon":"ComputerDesktopIcon","title":"ICT Integration in Education","description":"We support schools and institutions to embed Information and Communication Technology (ICT) into teaching and learning. This includes:","subItems":["Digital content development","Blended and remote learning solutions","Training for teachers in educational technology tools","ICT strategy and infrastructure planning","ICT integration into teaching and learning"]},{"icon":"/uploads/1768921476243-racheal_kalembe.jpg","title":"Teacher Training & Professional Development","description":"We design and deliver continuous professional development (CPD) programs that improve teaching practice, subject mastery, classroom management, and learner-centred pedagogy."},{"icon":"/uploads/1768921468709-Moses_Tuhame.jpg","title":"Stakeholder Capacity Development","description":"We strengthen the capacity of education stakeholders—including school leaders, policy makers, and community actors—through training, coaching, and systems support. We help build collaborative and effective education ecosystems."},{"icon":"MagnifyingGlassIcon","title":"Research, Monitoring & Evaluation","description":"We conduct educational research, needs assessments, and evaluations to inform policy, program design, and implementation."},{"icon":"PolicyAndTransformation","title":"Policy and Transformation","description":"We advocate for transformation of education systems, ownership and adoption of evidence-based innovation in the education system. We offer technical support for institutionalization of methodologies at school, district local governments and national develop to ensure scale-up and sustainability of innovations by governments."}],"team":[{"name":"DR. GRACE KIIRIA","role":"Expert in Educational Development, Management and Administration","image":"/uploads/1768920969943-Grace_Kiiria.jpg"},{"name":"MR. MOSES TUHAME","role":"Expert in ICT","image":"/images/team/Moses Tuhame.jpg"},{"name":"MS. RACHAEL KALEMBE","role":"Educationist and Professional trainer","image":"/images/team/racheal_kalembe.jpg"},{"name":"MR. NAIGO PAUL","role":"Expert in school leadership and teacher training","image":"/images/team/naigo Paul.jpg"},{"name":"MR. OMODING JONATHAN OKIA","role":"Graphics & Product Design Lead","image":"/images/team/Omoding Jonathan Okia .jpg"}],"approach":[{"icon":"/uploads/1768920991998-Moses_Tuhame.jpg","title":"Participatory & Contextualized","description":"We co-design solutions with clients and communities to ensure relevance and sustainability."},{"icon":"BeakerIcon","title":"Evidence-Based","description":"Our recommendations and training draw from global research, best practices, and local realities."},{"icon":"CpuChipIcon","title":"Technology-Enabled","description":"We promote digital solutions where they can increase reach, efficiency, and engagement."},{"icon":"CapacityFocused","title":"Capacity-Focused","description":"We empower clients and beneficiaries with the tools and skills they need to lead and sustain change."}],"partners":[{"name":"Ministries of Education and Government Agencies","icon":"AcademicCapIcon"},{"name":"Non-Governmental Organizations (NGOs)","icon":"NGOs"},{"name":"Schools and Teacher Training Institutions","icon":"BookOpenIcon"},{"name":"Development Partners and Donors","icon":"DevelopmentPartners"},{"name":"Community-Based Organizations","icon":"CommunityOrganizations"}],"contactInfo":{"email":"pdiaconsultancy@gmail.com","phone":"+256 772 193 208","address":"Mutebbi Rd Seeta. Mukono"},"about":{"title":"About PDIA","subtitle":"Advancing quality, relevance, and equity in learning.","whoWeAre":"PDIA Ltd is a leading education-focused consultancy firm committed to advancing quality, relevance, and equity in learning. We specialize in education system strengthening through evidence-based solutions in curriculum design, teacher training, ICT integration, and capacity building for key education stakeholders. And advocacy for integration of evidence-based innovations into national policy frameworks. With a team of experienced educators, policy experts, curriculum specialists, digital learning experts and instruction and pedagogy experts, we partner with governments, NGOs, schools, and development organizations to transform education.","mission":"To deliver innovative, inclusive, and sustainable education solutions that empower educators, learners, and communities to thrive in a dynamic and digital world.","vision":"To be a trusted partner in redefining education through locally relevant, globally informed, and technology-enhanced solutions."}}